CSI API ETABS v1
cDetailing.GetOneDetailedSlab_OneDetailingOutput_StripGUID Method
 Represents the detailed rebars in one rebar strip of the slab, as defined in ETABS
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetOneDetailedSlab_OneDetailingOutput_StripGUID(
	int DetailingOutputIndex,
	int StripIndex,
	ref string GUID_ETABS
)
Function GetOneDetailedSlab_OneDetailingOutput_StripGUID (
	DetailingOutputIndex As Integer,
	StripIndex As Integer,
	ByRef GUID_ETABS As String
) As Integer
Dim instance As cDetailing
Dim DetailingOutputIndex As Integer
Dim StripIndex As Integer
Dim GUID_ETABS As String
Dim returnValue As Integer
returnValue = instance.GetOneDetailedSlab_OneDetailingOutput_StripGUID(DetailingOutputIndex,
	StripIndex, GUID_ETABS)
int GetOneDetailedSlab_OneDetailingOutput_StripGUID(
	int DetailingOutputIndex,
	int StripIndex,
	String^% GUID_ETABS
)
abstract GetOneDetailedSlab_OneDetailingOutput_StripGUID :
        DetailingOutputIndex : int *
        StripIndex : int *
        GUID_ETABS : string byref -> int
Parameters
DetailingOutputIndex
Type: System.Int32
 Detailing Output Index
StripIndex
Type: System.Int32
 Strip Index
GUID_ETABS
Type: System.String
 ETABS GUID
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace